[
  "Fire Breath: Deals 8d6 fire damage in a 30-foot cone.",
  "Regeneration: Regenerates 2d8 hit points per turn unless it takes fire or poison damage.",
  "Stealth: Becomes invisible, increasing its chances to avoid attacks for the next turn.",
  "Poison Attack: Deals 4d6 poison damage on a hit.",
  "Flight: Can fly at a speed of 60 feet, allowing quick movement and obstacle avoidance.",
  "Ice Blast: Releases an icy breath, dealing 6d8 cold damage in a 40-foot radius.",
  "Earthquake: Creates a tremor, dealing 10d6 damage and knocking down targets within 20 feet.",
  "Lightning Strike: Strikes with lightning, dealing 7d10 lightning damage in a 30-foot radius.",
  "Shadow Step: Teleports in shadows up to 60 feet, avoiding attacks and repositioning.",
  "Telepathy: Communicates mentally with creatures within 120 feet.",
  "Invisibility: Becomes invisible for 1 minute or until taking an action.",
  "Shape Shifting: Transforms into another creature or form.",
  "Necrotic Touch: Deals 6d10 necrotic damage on a touch.",
  "Mind Control: Takes control of a creature's actions for 1d4 rounds.",
  "Summoning: Summons 2d6 creatures to assist in combat.",
  "Acid Spit: Spits acid, dealing 5d8 acid damage to a single target.",
  "Web Shot: Shoots webs to restrain targets for 1d6 rounds.",
  "Charm: Charms a creature for 1d8 rounds, making it friendly to the monster.",
  "Life Drain: Deals 6d8 necrotic damage and heals the monster for half the damage dealt.",
  "Fear Aura: Creates an aura of fear, causing creatures within 30 feet to make a DC 15 Wisdom saving throw or become frightened.",
  "Magic Resistance: Reduces incoming magical damage by half.",
  "Frost Aura: Deals 3d6 cold damage to creatures within 10 feet at the start of their turn.",
  "Charge: Charges at a target, dealing 6d6 bludgeoning damage and knocking it prone.",
  "Stone Gaze: Turns a creature to stone if it fails a DC 16 Constitution saving throw.",
  "Fireball: Launches a fireball that deals 8d6 fire damage in a 20-foot radius.",
  "Thunderclap: Deals 6d8 thunder damage to creatures within 15 feet.",
  "Petrifying Touch: Turns a creature to stone on a failed DC 15 Dexterity saving throw.",
  "Energy Absorption: Absorbs 5d8 damage from energy attacks and regains hit points equal to the damage absorbed.",
  "Howl of Terror: Forces creatures within 30 feet to make a DC 14 Wisdom saving throw or flee for 1d4 rounds.",
  "Blood Frenzy: Gains advantage on attack rolls against wounded targets.",
  "Healing Touch: Restores 4d8 hit points to a creature.",
  "Divine Smite: Deals 5d8 radiant damage on a successful attack.",
  "Entangling Vines: Restrains creatures within 20 feet for 1d6 rounds.",
  "Rock Throw: Throws a large rock, dealing 6d10 bludgeoning damage to a single target.",
  "Blink: Teleports 30 feet to an unoccupied space.",
  "Tail Sweep: Sweeps its tail, dealing 4d8 bludgeoning damage to creatures within 15 feet.",
  "Multiattack: Makes three melee attacks, each dealing 3d8 damage.",
  "Acid Cloud: Creates a cloud of acid, dealing 6d6 acid damage to creatures in a 20-foot radius.",
  "Soul Drain: Deals 8d10 necrotic damage and regains hit points equal to half the damage dealt.",
  "Phantom Strike: Strikes from the ethereal plane, dealing 5d10 force damage.",
  "Spirit Call: Summons 1d4 spirits to attack enemies.",
  "Sandstorm: Creates a sandstorm, dealing 4d6 damage and reducing visibility.",
  "Wind Gust: Pushes creatures back 10 feet and deals 3d6 damage.",
  "Darkvision: Sees in complete darkness up to 120 feet.",
  "Swallow Whole: Swallows a creature, dealing 6d8 acid damage per turn.",
  "Burning Grasp: Deals 4d8 fire damage on a touch.",
  "Piercing Screech: Deals 5d6 thunder damage and stuns creatures within 30 feet.",
  "Psychic Scream: Deals 6d8 psychic damage and causes confusion for 1d4 rounds.",
  "Explosive Leap: Jumps to a target, dealing 6d6 bludgeoning damage on impact.",
  "Water Surge: Deals 5d8 water damage in a 20-foot radius.",
  "Meteor Slam: Summons a meteor, dealing 10d10 fire damage in a 40-foot radius.",
  "Dispel Magic: Ends magical effects of level 3 or lower within 30 feet.",
  "Mirror Image: Creates three illusory duplicates for defense.",
  "Displacement: Appears to be displaced, granting disadvantage to attackers.",
  "Breath of Decay: Exhales a cloud of decay, dealing 7d8 necrotic damage in a 30-foot cone.",
  "Piercing Gaze: Deals 4d10 psychic damage to a single target within 60 feet.",
  "Mana Burn: Drains 3d8 mana or spell energy from a target.",
  "Slowing Touch: Slows a target's movement by half for 1d6 rounds.",
  "Venomous Spit: Deals 5d6 poison damage and poisons the target.",
  "Blinding Flash: Deals 3d8 radiant damage and blinds creatures within 20 feet.",
  "Rage: Enters a frenzy, gaining +2 to attack and dealing 1d8 extra damage per attack.",
  "Thunderwave: Deals 4d8 thunder damage and pushes creatures back 15 feet.",
  "Teleportation: Teleports up to 120 feet to an unoccupied space.",
  "Magma Burst: Erupts magma, dealing 6d10 fire damage in a 20-foot radius.",
  "Corrupting Touch: Deals 5d8 necrotic damage and reduces healing received by the target.",
  "Wing Buffet: Deals 4d6 bludgeoning damage and pushes creatures back 10 feet.",
  "Poison Cloud: Creates a cloud of poison, dealing 5d8 poison damage to creatures in a 15-foot radius.",
  "Grappling Tendrils: Restrains a target, dealing 3d8 damage per turn.",
  "Void Pulse: Deals 7d8 force damage and teleports the monster 30 feet.",
  "Illusionary Attack: Deals 4d6 psychic damage and confuses the target for 1d4 rounds.",
  "Seismic Stomp: Deals 5d10 bludgeoning damage and knocks creatures prone in a 20-foot radius.",
  "Vampiric Bite: Deals 6d8 piercing damage and heals the monster for half the damage dealt.",
  "Echoing Roar: Deals 5d6 thunder damage and frightens creatures within 30 feet.",
  "Stormcall: Deals 8d8 lightning damage to creatures in a 40-foot radius.",
  "Arcane Blast: Deals 6d10 arcane damage to a single target.",
  "Shattering Strike: Deals 5d10 damage and destroys non-magical objects.",
  "Water Jet: Deals 4d8 water damage and pushes a target 20 feet.",
  "Flame Lash: Deals 5d8 fire damage and sets the target ablaze.",
  "Soul Rend: Deals 8d10 necrotic damage and weakens the target's defenses."
]